In [6]:
import pandas as pd
import numpy as np

In [10]:
dict = {"Colombia": [1,2,3,8],
        "Argentina": [4,5, np.nan,None],
        "Brazil" : [7,8,9, None]}
dict

{'Colombia': [1, 2, 3, 8],
 'Argentina': [4, 5, nan, None],
 'Brazil': [7, 8, 9, None]}

In [12]:
df = pd.DataFrame(dict)
df

   Colombia  Argentina  Brazil
0         1        4.0     7.0
1         2        5.0     8.0
2         3        NaN     9.0
3         8        NaN     NaN

The Null data is a huge problem when we have to work with database, So we can identify the null data in our file, How?

With the command "Data's name.isnull()", we can identify which datas we have like null data. The command returns the value "True and False", being True the value "Null".

We also turn around the value True by 1, of this way we can identify esaser the the null values

In [13]:
df

   Colombia  Argentina  Brazil
0         1        4.0     7.0
1         2        5.0     8.0
2         3        NaN     9.0
3         8        NaN     NaN

In [14]:
df.isnull()

   Colombia  Argentina  Brazil
0     False      False   False
1     False      False   False
2     False       True   False
3     False       True    True

In [16]:
df.isnull()*1

   Colombia  Argentina  Brazil
0         0          0       0
1         0          0       0
2         0          1       0
3         0          1       1

Once identifed our null value, Also, we can transform the value by other value. For instante: If we have for or five null value and we need to turn it around by other value lis "message", math operation or value, is neccesary the command "fillna("new value). Ex:

In [17]:
df.fillna("Missing")

   Colombia Argentina   Brazil
0         1       4.0      7.0
1         2       5.0      8.0
2         3   Missing      9.0
3         8   Missing  Missing

In [27]:
df.fillna(100)

   Colombia  Argentina  Brazil
0         1        4.0     7.0
1         2        5.0     8.0
2         3      100.0     9.0
3         8      100.0   100.0

In [31]:
df.dropna()

   Colombia  Argentina  Brazil
0         1        4.0     7.0
1         2        5.0     8.0